---
layout: blogger
title: TechEd 2007
date: 2007-12-12T11:18:00.0000000-02:00
permalink: /:year/:month/:slug:output_ext
tags: [TechEd, Silverlight]
---
<p>Este ano eu tive a oportunidade de participar do TechEd 2007 sem ser apenas espectador.</p>  <p>Tudo come&#231;ou quando o Jo&#227;o Cabral, diretor de tecnologia da <a href="http://www.agenciaclick.com.br/">Ag&#234;nciaClick</a>, foi convidado pelo <a href="http://blogs.msdn.com/renedepaula">Ren&#233; de Paula</a> para apresentar um case de Silverlight. A id&#233;ia era que desenvolvessemos uma aplica&#231;&#227;o utilizando Silverlight e levassemos para o pessoal toda a experi&#234;ncia por tr&#225;s desse desenvolvimento e a import&#226;ncia de criar interfaces ricas para o usu&#225;rio.</p>  <p>Tendo isso como base, eu fiquei respons&#225;vel por estudar e desenvolver a solu&#231;&#227;o que seria apresentada. Devo dizer que para mim essa foi uma esperi&#234;ncia muito gratificante pois n&#227;o &#233; todo dia que se tem a oportunidade de trabalhar com uma tecnologia t&#227;o nova e interessante.</p>  <p>Desde o in&#237;cio do projeto at&#233; sua apresent&#231;&#227;o no TechEd transcorreu aproximadamente 1 m&#234;s. Desse per&#237;odo, 3 semanas foram dedicadas &#224; pesquisa, testes, provas de conceito e defini&#231;&#227;o do que seria desenvolvido. No final foi decidido que seria feita uma segunda vers&#227;o do testdrive virtual do Fiat Punto, mas dessa vez com a possibilidade de convidar os amigos do Live Messenger para participar do testdrive com voc&#234;.</p>  <p>Para a apresenta&#231;&#227;o no TechEd foi planejado um prot&#243;tipo que contemplou o seguinte:</p>  <ul>   <li>- Criar um novo testdrive. </li>    <li>- Efetuar login no Live Messenger, pelo site, para convidar amigos para o testdrive. </li>    <li>- Tela do testdrive mostrando o v&#237;deo e com funcionalidade de chat entre os participantes. </li> </ul>  <p>Foi definido que o prot&#243;tipo seria feito utilizando o release Silverlight 1.1 Alpha por possibilitar o desenvolvimento utilizando .NET al&#233;m do Javascript.</p>  <p>Agora a parte mais interessante, o desenvolvimento, foi o que mais me impressionou. Foram necess&#225;rios apenas 4 dias para desenvolver o prot&#243;tipo inteiro, do zero. A produtividade que se ganha utilizando o <a href="http://www.microsoft.com/expression/products/download.aspx?key=blend2preview">Expression Blend</a> e desenvolvendo em .NET &#233; absurda. Para desenhar a interface do testdrive foram necess&#225;rias apenas 6 horas!!!!</p>  <p>N&#227;o &#233; a toa que a apresenta&#231;&#227;o foi um sucesso. Ali&#225;s, o sucesso foi t&#227;o grande que eu fui convidado pelo <a href="http://blogs.msdn.com/cguimar">C&#233;zar Guimar&#227;es</a> para mostrar o aplicativo na apresenta&#231;&#227;o dele tamb&#233;m. V&#225;rias pessoas me procurarm ao longo do evento com d&#250;vidas e mostrando interesse na aplica&#231;&#227;o, o que me deixou muito satisfeito.</p>  <p>Para quem n&#227;o p&#244;de ir ao TechEd ou n&#227;o assistiu &#224; essas palestras, segue abaixo alguns links para posts contendo fotos e pequenos v&#237;deos das palestras e tamb&#233;m para um podcast onde o Ren&#233;, o C&#233;zar e eu falamos um pouco sobre tudo isso.</p>  <p>Blog do Ren&#233; de Paula</p>  <ul>   <li><a title="http://blogs.msdn.com/renedepaula/archive/2007/12/06/direto-do-tech-ed-2007.aspx" href="http://blogs.msdn.com/renedepaula/archive/2007/12/06/direto-do-tech-ed-2007.aspx">Direto do TechEd 2007</a> </li>    <li><a title="http://blogs.msdn.com/renedepaula/archive/2007/12/06/gente-que-faz-uau-ag-nciaclick-e-o-test-drive-social-em-v-deo.aspx" href="http://blogs.msdn.com/renedepaula/archive/2007/12/06/gente-que-faz-uau-ag-nciaclick-e-o-test-drive-social-em-v-deo.aspx">Gente que faz UAU - AgenciaClick e o test-drive social em video</a> </li>    <li><a title="http://blogs.msdn.com/renedepaula/archive/2007/12/06/tech-ed-2007-um-site-social-usando-live-silverlight-e-ajax.aspx" href="http://blogs.msdn.com/renedepaula/archive/2007/12/06/tech-ed-2007-um-site-social-usando-live-silverlight-e-ajax.aspx">Tech Ed 2007: um site social usando Live, Silverlight e Ajax</a> </li>    <li><a title="http://blogs.msdn.com/renedepaula/archive/2007/12/06/tech-ed-2007-kelps-demonstra-o-test-drive-social-em-silverlight-e-live.aspx" href="http://blogs.msdn.com/renedepaula/archive/2007/12/06/tech-ed-2007-kelps-demonstra-o-test-drive-social-em-silverlight-e-live.aspx">Tech Ed 2007: Kelps demonstra o Test Drive Social em Silverlight e Live</a> </li>    <li>     <p>Blog do Cezar Guimar&#227;es</p>   </li>    <li><a title="http://blogs.msdn.com/cguimar/archive/2007/12/13/xamlcast-www-xamlcast-net.aspx" href="http://blogs.msdn.com/cguimar/archive/2007/12/13/xamlcast-www-xamlcast-net.aspx">Cezar Guimar&#227;es - XAMLCast - www.xamlcast.net</a> </li>    <li>     <p>Podcast de Roberto Sonnino e Rodrigo Kono</p>   </li>    <li><a href="http://www.xamlcast.net">XAMLCast</a>       <p></p>   </li> </ul>  <p>No pr&#243;ximo post vou publicar um passo a passo para desenvolver uma aplica&#231;&#227;o em Silverlight 1.1 utilizando web services e hospedada em um site ASP.NET 2.0.</p>  
